Repository: Piwigo/Piwigo-Mobile
Catalog: piwigo/Resources/ReleaseNotes.xcstrings
Source language: en
Languages: ar, da, de, es, fr, hu, id, it, ja, nl, pl, ru, sv, zh_hans, zh_hant

# v1.0.0_text
source: Version 1.0 October 17, 2011
ar: الإصدار 1.0 17 أكتوبر 2011
da: Version 1.0 17 oktober 2011
de: Version 1.0 17. Oktober 2011
es: Versión 1.0 17 de octubre 2011
fr: Version 1.0 17 octobre 2011
hu: 1.0-ás verzió 2011 Október 17
id: Versi 1.0 17 Oktober, 2011
it: Versione 1.0 17 ottobre 2011
ja: バージョン 1.0 2011年10月17日
nl: Versie 1.0 17 Oktober 2011
pl: Wersja 1.0 17 października 2011
ru: Версия 1.0 17 oктябрь 2011
sv: Version 1.0 17 oktober 2011
zh_hans: 版本 1.0 2011年10月17日
zh_hant: 版本 1.0 2011年10月17日

# v2.0.0_text
source: Version 2.0 April 24, 2015 New native application featuring: - Ability to manage albums - View your photos - Bulk photo upload - Video upload and playback (VideoJS plugin must be installed)
ar: الإصدار 2.0 24 نيسان (أبريل) 2015 تطبيق الأصلي الجديد يضم: - القدرة على إدارة الألبومات - عرض الصور الخاصة بك - تحميل الصورة السائبة - تحميل الفيديو وتشغيل (يجب تثبيت فيدوجس البرنامج المساعد)
da: Version 2.0 24 April 2015 Nye indbyggede funktioner: - Mulighed for at administrere album - Se dine billeder - Bulk billedupload - Video upload og afspilning (VideoJS plugin skal være installeret)
de: Version 2.0 24. April 2015 Neue native App mit den Funktionen: - Alben - Verwaltung - Fotos ansehen - Hochladen von mehreren Fotos - Video hochladen und Wiedergabe (VideoJS Erweiterung muss auf dem Piwigo-Server installiert sein) ________________________________________
es: Versión 2.0 24 de abril 2015 Nueva aplicación nativa con las siguientes características: - Posibilidad de administrar álbumes - Ver tus fotos - Subir fotos en masa - Subir y reproducir vídeos (debe estar instalado el plugin VideoJS)
fr: Version 2.0 24 avril 2015 Application entièrement réécrite : - Naviguez dans votre Piwigo, avec affichage des photos - Gérez vos albums (création, édition, déplacement) - Sélectionnez vos photos par lot - Gestion des vidéos (le plugin VideoJS doit être activé sur votre Piwigo)
hu: 2.0-ás verzió 2015 Április 24 Új natív alkalmazás a következőkkel: - Lehetőség albumok menedzselésére - Saját fotók megtekintése - Tömeges fotófeltöltés - Videófeltöltés és lejátszás (a VideoJS bővítménynek telepítve kell lennie)
id: Versi 2.0 24 April 2015 Aplikasi asli baru yang menampilkan: - Kemampuan untuk mengelola album - Melihat gambar Anda - Unggah gambar secara massal - Unggah dan pemutaran video (ekstensi VideoJS harus terpasang)
it: Versione 2.0 24 aprile 2015 Nuova applicazione nativa con: - Possibilità di gestire album - Guarda le tue immagini - Caricamento di immagini collettive - Caricamento e riproduzione video (deve essere installato il plug-in VideoJS)
ja: バージョン 2.0 2015年4月24日 以下を特徴とする新しいネイティブアプリケーション: - アルバムを管理する機能 - 写真を見る - 写真の一括アップロード - 動画のアップロードと再生 (要VideoJSプラグインのインストール)
nl: Versie 2.0 24 April 2015 Nieuwe native applicatie met‎: - Mogelijkheid om albums te beheren - Bekijk je foto's - Bulk foto's uploaden - Video uploaden en afspelen ‎(VideoJS-plug-in moet zijn geïnstalleerd)
pl: Wersja 2.0 24 kwiecień 2015 Nowa natywna aplikacja oferuje: - możliwość zarządzania albumami - przeglądanie Twoich zdjęć - hurtowe przesyłanie zdjęć - przesyłanie i odtwarzanie filmów (musi być zainstalowany dodatek VideoJS)
ru: Версия 2. 24 апреля 2015 Новые встроенные функции приложения: - Возможность управления альбомами - Просмотр фотографий - Массовая загрузка фото - Загрузка и воспроизведение видео (необходимо установить плагин VideoJS)
sv: Version 2.0 24 april 2015 Nya inbyggda funktioner: - Möjlighet att hantera album - Visa dina bilder - Massuppladdning av bilder - Video uppladdning och uppspelning (VideoJS-plugin måste installeras)
zh_hans: 版本 2.0 2015年4月24日 支持新特性： • 管理相册 • 查看您的照片 • 批量图像上传 • 视频上传和播放 (必须安装VideoJS 插件)
zh_hant: 版本 2.0 2015年4月24日 新的原生應用程式包含: - 檢視及管理相簿 - 檢視你的照片 - 大量照片上傳 - 影片上傳及播放 (需要安裝VideoJS插件)

# v2.0.1_text
source: Version 2.0.1 June 26, 2015 New settings: - Option to resize photos upon upload + Image quality is from a range of 50 - 98 percents - Ability to set a default photo preview size Bug fixes
ar: الإصدار 2.0.1 26 حزيران (يونيو) 2015 إعدادات جديدة: - الخيار لتغيير حجم الصور عند التحميل + جودة الصورة هي من مجموعة من 50 - 98٪ - القدرة على تعيين الافتراضي حجم معاينة الصورة اصلاحات الشوائب
da: Version 2.0.1 26 juni 2015 Nye indstillinger: - Mulighed for at ændre størrelsen på billederne på upload + Billedkvaliteten er fra en vifte af 50-98% - Mulighed for at sætte en standard billede preview størrelse Fejlrettelser
de: Version 2.0.1 26. Juni 2015 Neue Einstellungen: - Option, um die Größe von Fotos während des Hochladens zu ändern + Fotoqualität zwischen 50-98% auswählbar - Möglichkeit um eine Standard Miniaturfotogröße festzulegen Fehlerbehebungen ________________________________________
es: Versión 2.0.1 26 de junio 2015 Nuevos ajustes: - Opción de redimensionar fotos al subirlas + La calidad de imagen abarca un rango de 50 - 98% - Posibilidad de establecer un tamaño de vista previa predeterminada Corrección de errores
fr: Version 2.0.1 26 juin 2015 Nouveaux réglages : - Option pour redimensionner les photos avant envoi au serveur + Qualité d'image entre 50 et 98% - Possibilité de fixer une taille par défaut des photos affichées
hu: 2.0.1-es verzió 2015 Június 25 Új beállítások: - Fotók átméretezésének lehetősége feltöltéskor + Kép minőségi beállításai 50 - 98%-os tartományban - Lehetőség alapértelmezett fotó-előnézteti kép méretének beállítására Hibajavítások
id: Versi 2.0.1 26 Juni 2015 Setelan baru: - Opsi untuk mengubah ukuran gambar saat diunggah + Kualitas gambar dari kisaran 50 - 98% - Kemampuan untuk mengatur ukuran pratinjau gambar standar Perbaikan bug
it: Versione 2.0.1 26 giugno 2015 Nuove impostazioni: - Opzione per ridimensionare le immagini al caricamento + La qualità dell'immagine varia da 50 a 98% - Possibilità di impostare una dimensione di anteprima dell'immagine predefinita Correzioni di bug
ja: バージョン 2.0.1 2015年6月26日 新しい設定: - アップロード時に写真をリサイズするオプション + 写真品質は 50 - 98% の範囲 - 規定の写真プレビューサイズを設定する機能 バグの修正
nl: Versie 2.0.1 26 Juni 2015 Nieuwe instellingen‎: - Optie om het formaat van afbeeldingen te wijzigen bij het uploaden + De beeldkwaliteit is van een bereik van 50 - 98% - Mogelijkheid om een standaardfotovoorbeeld in te stellen Foutjes verbeterd
pl: Wersja 2.0.1 26 czerwca 2015 Nowe ustawienia: - możliwość zmiany rozmiaru przesyłanych zdjęć + jakość zdjęcia z zakresu 50 - 98% - możliwość ustawienia domyślnego rozmiaru podglądu zdjęcia Poprawki
ru: Версия 2.0.1 26 июня 2015 Новые настройки: - Возможность изменения размера фото после загрузки + Качество изображения от 50 до 98% - Возможность задавать размер изображения по умолчанию Исправления ошибок
sv: Version 2.0.1 26 juni 2015 Nya inställningar: - Alternativ för att ändra storlek på bilder vid uppladdning + Bildkvaliteten är från ett område på 50 - 98% - Möjlighet att ställa in en standardbildsförhandsgranskningstorlek Bug fixar
zh_hans: 版本 2.0.1 2015年7月26日 新设置： • 在上传时调整图像大小 • 图像质量可选范围 50 - 98% • 设置默认图像预览大小 • 错误修复
zh_hant: 版本 2.0.1 2015年6月26日 新的設定: - 上傳時調整尺寸 + 照片品質可以從50-98% - 可以設定預設照片預覽大小 問題修正

# v2.0.2_text
source: Version 2.0.2 May 8, 2017 • Sort criteria now identical to those of the Web app • Fix sort issues • Fix a crash encountered when adding tags to a photo before upload • Fix situations where the deletion of a selection of photos did not work • Fix situations where an album did not show up after move • Fix a compatibility issue with iOS 10 — deprecated code
ar: الإصدار 2.0.2 8 مايو 2017 • معايير التصنيف مطابقة الآن لتلك التي من التطبيق على شبكة الإنترنت • إصلاح قضايا الفرز • إصلاح تحطم واجهت عند إضافة علامات إلى صورة قبل التحميل • إصلاح الحالات حيث حذف مجموعة مختارة من الصور لم تنجح • إصلاح الحالات حيث ألبوم لم تظهر بعد التحرك • إصلاح مشكلة التوافق مع دائرة الرقابة الداخلية 10 - رمز موقوف
da: Version 2.0.2 8 maj 2017 • Sorteringskriterier nu identiske med dem i Web app • Fix af sorteringsproblemer • Fix af nedbrud når du tilføjer tags til et foto før upload • Fix af situationer hvor sletningen af et udvalg af billeder ikke virkede • Fix af situationer hvor et album ikke dukker op efter flytning • Løst et kompatibilitetsproblem med iOS 10 — deprecieret kode
de: Version 2.0.2 8. Mai 2017 • Sortierkriterien sind jetzt identisch zur Piwigo Web App • Fehlerbehebung von Sortierungsfehlern • Fehlerbehebung Absturz beim Hinzufügen von Schlagwörtern zu einem Foto vor dem Hochladen • Fehlerbehebung für Situationen bei denen das Löschen ausgewählter Fotos nicht funktionierte • Fehlerbehebung für Situationen bei denen ein Album nach dem Verschieben nicht angezeigt wurde • Fehlerbehebung von Kompatibilitätsproblem mit iOS 10 — veralteter Code ________________________________________
es: Versión 2.0.2 8 de mayo 2017 • Ahora los criterios de ordenación son idénticos a los de la aplicación Web • Corrección de problemas de ordenación • Corregido un error encontrado al añadir etiquetas a una foto antes de subirla • Corregidas situaciones en las que la eliminación de una selección de fotos no funcionaba • Corregidas situaciones en las que un álbum no aparecía después de moverlo • Corregido un problema de compatibilidad con iOS 10 — código obsoleto
fr: Version 2.0.2 8 mai 2017 • Critères de tri maintenant identiques à ceux de l'application web • Règle des problèmes de tri • Règle un problème de crash rencontré à l'ajout de tags avant l'envoi de photos • Règle des situations où l'effacement d'une sélection de photos ne fonctionnait pas • Règle des situations où un album n'apparaissait pas après son déplacement • Règle des problème d'incompatibilité avec iOS 10
hu: 2.0.2-es verzió 2017 Május 8 • Rendezési kritériumok immár egyeznek a webfelületen láthatóakkal • Kijavítja a rendezés hibáit • Kijavít egy hibát, amitől a feltöltés előtti fotókhoz felvett címkék az alkalmazás összeomlásához vezettek • Kijavítja a kiválasztott fotók törlése során tapasztalt hibákat • Kijavítja a hibát, amitől az albumok eltűntek mozgatást követően • Kijavít egy iOS 10 kompatibilitási problémát — elavult kód
id: Versi 2.0.2 8 Mei 2017 • Kriteria sortir sekarang identik dengan aplikasi Web • Perbaikan masalah sortir • Perbaikan kecelakaan saat menambahkan tag ke foto sebelum diunggah • Perbaikan situasi di mana penghapusan pilihan gambar tidak bekerja • Perbaikan situasi di mana album tidak muncul setelah dipindahkan • Perbaikan masalah kompatibilitas dengan kode iOS 10 - tidak berlaku lagi
it: Versione 2.0.2 8 maggio 2017 • I criteri di ordinamento ora sono identici a quelli dell'applicazione Web • Risolvi problemi di ordinamento • Risolto un crash che si verificava durante l'aggiunta di tag a una foto prima del caricamento • Risolvere situazioni in cui la cancellazione di una selezione di immagini non ha funzionato • Risolvi le situazioni in cui un album non si presentava dopo lo spostamento • Risolve un problema di compatibilità con iOS 10 - codice deprecato
ja: バージョン 2.0.2 2017年5月8日 • 並び順の基準をWeb appと統一 • 写真をアップロードする前にタグ付けするとクラッシュするバグを修正 • 選択した写真の削除ができなくなる状況を修正 • アルバムを移動した後で見えなくなる状況を修正 • iOS 10との互換性問題を修正 — 廃止予定のコード
nl: Versie 2.0.2 8 Mei 2017 • Sorteercriteria zijn nu identiek aan die van de Web-app • Sorteerproblemen opgelost • Een crash verholpen die optrad bij het toevoegen van labels aan een foto vóór het uploaden • Verbeterde situaties waarin het verwijderen van een selectie van afbeeldingen niet werkte • Verbeterde situaties waarin een album niet te zien was na verplaatsing • Verbeterd een compatibiliteitsprobleem op iOS 10 - verouderde code
pl: Wersja 2.0.2 8 maja 2017 • Kryteria sortowania teraz identyczne z aplikacją Web • Poprawka problemu z sortowaniem • Poprawka awarii napotkanych podczas dodawania znaczników do zdjęć przed wysłaniem • Poprawka sytuacji gdzie nie działało usunięcie zaznaczonych zdjęć • Poprawka sytuacji gdzie album nie pojawiał się po przeniesieniu • Rozwiązany problem ze zgodnością z systemem iOS 10 — przestarzały kod
ru: Версия 2.0.2 8 мая 2017 • Сортировка теперь идентична критериям веб-приложения • Исправлены проблемы сортировки • Исправьте сбой при добавлении тегов к фото перед загрузкой • Исправьте ситуации, когда удаление выборки фотографий не работает • Исправьте ситуации, когда альбом не появился после перемещения • Исправьте проблему совместимости с iOS 10 — устарел код
sv: Version 2.0.2 8 maj 2017 • Sorteringskriterier som nu är identiska med webapplikation • Fixat sorteringsproblem • Fixat en krasch som uppstod när du lägger till taggar i en bild före uppladdning • Fixat situationer där radering av ett urval bilder inte fungerade • Fixat situationer där ett album inte visades efter flyttning • Fixat ett kompatibilitetsproblem med iOS 10 - utfasad kod
zh_hans: 版本 2.0.2 2017年5月8日 • 排序参数现在与Web端一致 • 修复排序问题 • 修复在上传前为图片增加标签时崩溃的bug • 修复删除多个已选图片失败的bug • 修复相册移动后不显示的bug • 修复一个与iOS 10相册兼容的问题
zh_hant: 版本 2.0.2 2017年5月8日 • 排序方法現在跟網路版一致 • 修正排序問題 • 修正一個上傳前增加標籤會造成閃退的問題 • 修正了無法成功刪除多個照片的問題 • 修正了在相簿移動後沒出現的問題 • 修正了與iOS 10的相容性問題 - 已棄用的程式碼

# v2.0.3_text
source: Version 2.0.3 May 26, 2017 • Add option to strip GPS metadata in Settings page • Add current cache usage in Settings page • Fix cache settings sometimes forgotten/reset • Fix upload photo settings sometimes lost/reset
ar: الإصدار 2.0.3 26 مايو 2017 • إضافة خيار لتجريد البيانات الوصفية غس في صفحة إعدادات • إضافة استخدام ذاكرة التخزين المؤقت الحالي في صفحة إعدادات • إصلاح إعدادات ذاكرة التخزين المؤقت في بعض الأحيان نسي / إعادة تعيين • إصلاح تحميل إعدادات الصورة في بعض الأحيان فقدت / إعادة تعيين
da: Version 2.0.3 26 maj 2017 • Tilføjet mulighed for at strippe GPS-metadata i indstillingerne • Tilføjet aktuelt cache brug i indstillingerne • Fix af at cache indstillinger undertiden blev glemt/reset • Fix af at indstillinger for billedupload undertiden blev glemt/reset
de: Version 2.0.3 Mai 26, 2017 • Option in den Einstellungen hinzugefügt um GPS-Metadaten zu löschen • Cache-Nutzung in den Einstellungen ersichtlich • Fehlerbehebung Cache Einstellungen wurden manchmal gelöscht/Reset • Fehlerbehebung Foto hochladen Einstellungen wurden manchmal gelöscht/Reset
es: Versión 2.0.3 26 de mayo 2017 • Añadida opción para eliminar los metadatos de GPS en la página de ajustes • Añadido el uso actual de caché en la página de ajustes • Corregido el olvido/restablecimiento a veces de los ajustes de caché • Corregida la pérdida/restablecimiento a veces de los ajustes de subida de fotos
fr: Version 2.0.3 26 mai 2017 • Propose une nouvelle option permettant d'effacer les métadonnées GPS des images envoyées au serveur • Affiche désormais les volumes de cache utilisés dans la page Settings • Règle les situations où les réglages de cache étaient perdus ou modifiés • Règle les situations où les réglages des images envoyées étaient perdus ou réinitialisés
hu: 2.0.3-as verzió 2017 Május 26 • Új lehetőség a GPS metaadatok eltávolítására a beállítások oldalon • Jelenlegi gyorsítótár használati adatok mutatása a beállítások oldalon • Kijavít egy hibát, amitől a gyorsítótár beállításainak mentése/alaphelyzetbe állítása sikertelen volt • Kijavít egy hibát, amitől a fotók feltöltési beállításai néha elvesztek/alaphelyzetbe álltak vissza
id: Versi 2.0.3 26 Mei 2017 • Tambahkan opsi untuk mengupas metadata GPS di halaman Pengaturan • Tambahkan penggunaan tembolok saat ini di halaman Pengaturan • Perbaiki pengaturan tembolok terkadang terlupakan/atur ulang • Perbaiki pengaturan gambar unggah terkadang hilang/atur ulang
it: Versione 2.0.3 26 maggio 2017 • Aggiungi l'opzione per rimuovere i metadati GPS nella pagina Impostazioni • Aggiungi l'utilizzo della cache corrente nella pagina Impostazioni • Correggere le impostazioni della cache a volte dimenticate / ripristinate • Correggere le impostazioni di caricamento dell'immagine a volte perse / ripristinate
ja: バージョン 2.0.3 2017年5月26日 • 設定ページにGPSメタデータを除去するオプションを追加 • 設定ページに現在のキャッシュ使用量を追加 • キャッシュの設定が忘れられたりリセットされる問題を修正 • 写真アップロードの設定が忘れられたりリセットされる問題を修正
nl: Versie 2.0.3 26 Mei 2017 • Optie toegevoegd om GPS-metadata te strippen op de pagina Instellingen • Huidige cache-gebruik toevoegen op de pagina Instellingen • Verbeterde cache-instellingen soms vergeten ‎/ opnieuw instellen • Verbeterde upload beeldinstellingen soms verloren ‎/ opnieuw instellen
pl: Wersja 2.0.3 26 maja 2017 • Dodaj opcję usunięcie metadanych GPS w ustawieniach strony • Dodaj bieżące użycie pamięci podręcznej w ustawienia strona • Poprawka pamięci podręcznej ustawienia czasami zapomniane/reset • Poprawka wysyłania obrazu ustawienia czasami stracił/reset
ru: Версия 2.0.3 26 мая 2017 • Добавить опцию к разделению метаданных GPS на странице настроек • Добавить текущее использование кэша в Настройках • Фиксация настроек кэша иногда забыты/сброса • Исправить настройки загрузки изображений иногда утеряна/сброса
sv: Version 2.0.3 26 maj 2017 • Lagt till alternativ för att ta bort GPS-metadata på inställningssidan • Lagt till aktuell cache-användning på inställningssidan • Fixat cache-inställningar som ibland var glömda/återställda • Fixat uppladdning av bildinställningar som ibland blev förlorade/återställda
zh_hans: 版本2.0.3 2017年5月26日 • 在设置里添加删除GPS元数据的选项 • 在设置页面添加当前缓存用量选项 • 修复缓存设置有时被重置的问题 • 修复上传图像设置有时被重置的问题
zh_hant: 版本 2.0.3 2017年5月26日 • 設定中增加刪除GPS中繼資料的選項 • 設定中增加目前快取使用狀況 • 修正快取設定有時會被忘記/重置 • 修正上傳照片設定有時會被忘記/重置

# v2.0.4_text
source: Version 2.0.4 July 28, 2017 • iPad — Fix fuzzy thumbnails and the impossibility to edit photos on iPad • Videos — Fix upload and download issues (VideoJS extension required on server) • Settings — Add options to remove titles & change thumbnails resolution • Improve connection reliability and inform when upload completed • Minor bug fixes and improvements of the interface
ar: الإصدار 2.0.4 28 يوليو 2017 • باد - إصلاح الصور المصغرة غامض واستحالة تحرير الصور على باد • فيديو - إصلاح تحميل وتحميل القضايا (فيدوجس التمديد المطلوبة على الخادم) • إعدادات - إضافة خيارات لإزالة العناوين وتغيير الصور المصغرة القرار • تحسين موثوقية الاتصال وإعلام عند اكتمال التحميل • إصلاحات الشوائب طفيفة وتحسين واجهة
da: Version 2.0.4 28 juli 2017 • iPad-Fix fuzzy miniaturer og er manglende muligheden for at redigere billeder på iPad • Videoer — Fix af upload og download spørgsmål (VideoJS extension kræves på serveren) • Indstillinger — Tilføjet mulighed for at fjerne titler & ændre miniaturer opløsning • Forbedret forbindelsesstabilitet og information når upload er afsluttet • Mindre fejlrettelser og forbedringer af brugergrænsefladen
de: Version 2.0.4 28. Juli 2017 • iPad - Fehlerbeseitigung für unscharfe Miniaturen und der fehlenden Bearbeitungsmöglichkeit von • Videos - Fehlerbehebung mein Hoch- und Herunterladen ‎(VideoJS Erweiterung auf dem Piwigo Server erforderlich‎) • Einstellungen - Optionen hinzugefügt um Titel zu entfernen und die Auflösung von Miniaturfotos verändern zu können • Verbessert - Zuverlässigkeit bei der Serververbindung, Meldung wenn das Hochladen abgeschlossen wurde • Kleinere Fehler beseitigt und Verbesserungen der Benutzeroberfläche
es: Versión 2.0.4 28 de julio 2017 • iPad — Corrección de las miniaturas difusas y de la imposibilidad de editar fotos en iPad • Vídeos — Corrección de problemas de carga y descarga (extensión VideoJS requerida en el servidor) • Ajustes — Añadidas opciones para eliminar títulos y cambiar resolución de miniaturas • Mejorada la fiabilidad de la conexión, y se informa cuando se completa la carga • Corrección de errores menores y mejoras en la interfaz
fr: Version 2.0.4 28 juillet 2017 • iPad — Règle le problème de vignettes floues et l'impossibilité d'éditer les photos • Vidéos — Règle des problèmes de téléchargement et d'envoi (extension VideoJS requise sur le serveur) • Réglages — Ajoute des options pour retirer les titres et changer la résolution des vignettes • Améliore la fiabilité de la connexion et informe quand l'envoi d'images/vidéos est terminé • Corrections de bugs mineurs et amélioration de l'interface
hu: 2.0.4-es verzió 2017 Július 28 • iPad — Kijavítja az elmosódott bélyegképek, és a szerkesztési lehetőség elvesztésének problémáját. • Videók — Kijavítja a feltöltés és letöltés hibáit (VideoJS bővítményre szükség van a szerveren) • Beállítások — Add options to remove titles & change thumbnails resolution • Kapcsolat megbízhatóságának továbbfejlesztése, és a feltöltés befejezését megerősítő információ • Kisebb hibajavítások és fejlesztések a felületen
id: Versi 2.0.4 28 Juli 2017 • iPad - Perbaikan gambar mini fuzzy dan ketidakmampuan untuk mengedit foto di iPad • Video - Perbaikan masalah unggah dan unduh (ekstensi VideoJS diperlukan pada peladen) • Pengaturan - Menambahkan opsi untuk menghapus judul & mengubah resolusi gambar mini • Perbaikan keandalan koneksi dan informasi saat proses unggah selesai • Perbaikan bug minor dan perbaikan antarmuka
it: Versione 2.0.4 28 luglio 2017 • iPad - Risolvi le anteprime fuzzy e l'impossibilità di modificare le foto su iPad • Video: risoluzione dei problemi di caricamento e download (estensione VideoJS richiesta sul server) • Impostazioni - Aggiungi opzioni per rimuovere titoli e modificare la risoluzione dei thumbnails • Migliora l'affidabilità della connessione e informa quando il caricamento è completato • Correzioni di bug minori e miglioramento dell'interfaccia
ja: バージョン 2.0.4 2017年7月28日 • iPad — ぼやけたサムネイルと写真編集できない問題を修正 • 動画 — アップロードとダウンロードに関する問題を修正 (サーバにVideoJS拡張が必要) • 設定 — 題名の削除とサムネイルの解像度変更のオプションを追加 • 接続の信頼性を改善、アップロードが完了した時に通知 • 軽微なバグの修正とインタフェースの改善
nl: Versie 2.0.4 28 Juli 2017 • iPad — Vage miniaturen verbeterd en de onmogelijkheid om foto's te bewerken op de iPad • Video's — Problemen met uploaden en downloaden verholpen ‎(VideoJS-extensie vereist op server‎) • Instellingen — Opties toegevoegd om titels te verwijderen en de resolutie van miniaturen te wijzigen • De betrouwbaarheid verbeterd van de verbinding en melding wanneer het uploaden is voltooid • Kleine foutjes verbeterd en verbetering van de interface
pl: Wersja 2.0.4 28 lipca 2017 • iPad — naprawić rozmyte miniatury i niemożliwość edycji zdjęć na iPadzie • Filmy — poprawka wysyłania i pobierania problemy (wymagane na serwerze rozszerzenia VideoJS) • Ustawień — Dodaj opcje aby usunąć tytuły & zmiana miniatury rozdzielczość • Poprawić niezawodność połączeń i informuje, kiedy przesyłanie zakończone • Poprawki błędów i usprawnienia interfejsu
ru: Версия 2.0.4 28 июля 2017 • iPad — Исправь нечеткие эскизы и невозможность редактировать фотографии на iPad • Видео — Исправить проблемы загрузки и загрузки (требуется расширение VideoJS на сервере) • Настройки— Добавить опции, чтобы удалить заголовки и изменить разрешение эскизов • Улучшить надежность подключения и сообщить о завершении загрузки • Исправления мелких ошибок и улучшения интерфейса
sv: Version 2.0.4 28 juli 2017 • iPad - Fixat suddiga miniatyrbilder och omöjligheten att redigera bilder på iPad • Videor - Fixat uppladdning och nedladdning (VideoJS-tillägg krävs på servern) • Inställningar - Lagt till alternativ för att ta bort titlar & ändra miniatyrbildsupplösning • Förbättrad anslutningsäkerhet och informerar när uppladdningen är klar • Mindre buggfixar och förbättring av gränssnittet
zh_hans: 版本2.0.4 2017年7月28日 • iPad - 修复模糊缩略图和iPad无法编辑照片的问题 • 视频 - 修复上传和下载问题 (服务器需要安装VideoJS扩展) • 设置 - 添加删除标题和改变缩略图分辨率的选项 • 提高上传完成时连接的可靠性， • 错误修复和界面改进
zh_hant: 版本 2.0 2017年7月28日 • iPad - 修復模糊縮圖及無法編輯照片的問題 • 影片 - 修正上傳及下載問題(伺服器端需要VideoJS插件) • 設定 - 增加刪除標題及改變縮圖解析度的功能 • 改善連線可靠性及在上傳完成時通知 • 小型錯誤修正及介面改進
